// 2.  Разделение числа на символы
// Напишите программу, которая будет получать от пользователя число с 4 числами.
// Реализуйте разделение этого числа на отдельные цифры. 
// Пример:
// // Число 5934
// // Результат 5, 9, 3, 4
// Важно: число вводит пользователь с клавиатуры.

using System;

namespace lesson3_task2
{
    class Program
    {
        static void Main()
        {
            Console.WriteLine("Введите 4-значное число:");
            short num = Convert.ToInt16(Console.ReadLine());
            Console.WriteLine($"{num/1000}, {(num%1000)/100}, {((num%1000)%100)/10}, {((num%1000)%100)%10}");
        }
    }
}
