// Точка и круг
// Даны координаты точки и радиус круга с центром в начале координат. 
// Определить, принадлежит ли данная точка кругу.
// Описание переменных: 
// x, y, r - координаты точки и радиус круга;
// r_xy - длина гипотенузы (расстояния от начала координат до точки).
// Алгоритм решения задачи: 
// Следует рассмотреть прямоугольный треугольник, один катет которого лежит на любой оси, а другой 
// является перпендикуляром к этой оси из заданной точки. В этом случае длины катетов равны значениям 
// x и y, а гипотенуза является отрезком, соединяющим начало координат с точкой. Если этот отрезок не 
// больше радиуса круга, то делается вывод, что точка принадлежит кругу.
// Длина гипотенузы находится по теореме Пифагора: a2 + b2 = c2.

using System;

namespace lesson5_task7
{
    class Program
    {
        static void Main()
        {
            Console.Write("Введите радиус круга с центром в начале координат: ");
            double r = Convert.ToSingle(Console.ReadLine());
            Console.Write("Введите координату точки по оси X: ");
            double x = Convert.ToSingle(Console.ReadLine());
            Console.Write("Введите координату точки по оси Y: ");
            double y = Convert.ToSingle(Console.ReadLine());
            double r_xy = Math.Sqrt(x * x + y * y);
            if (r_xy <= r)
                System.Console.WriteLine("Точка принадлежит кругу");
            else
                System.Console.WriteLine("Точка не принадлежит кругу");

        }
    }
}
