// Определение дня недели
// Введите число от 1 до 7, которое будет соответствовать дню недели.
// Например: при вводе числа 1 на экране будет выводиться «Monday» и т. д.
// Сделайте подобную проверку при помощи операторов switch case.

using System;

namespace lesson5_task5
{
    class Program
    {
        static void Main()
        {
            Console.WriteLine("Введите номер дня недели от 1 (понедельник) до 7 (воскресенье):");
            string num = Console.ReadLine();
            string day = num switch
                {"1" => "Понедельник",
                "2" => "Вторник",
                "3" => "Среда",
                "4" => "Четверг",
                "5" => "Пятница",
                "6" => "Суббота",
                "7" => "Воскресенье",
                _ => "Попробуйте еще раз"};
            Console.WriteLine(day);
        }
    }
}
