// 5.  Работа с числами
// 2642 дня записано в переменной. Определите количество лет, недель, дней.
// // Дней - 2642
// // Вывод будет следующим
// "Лет: 7, недель: 12, дней: 3"

using System;

namespace lesson3_task5
{
    class Program
    {
        static void Main()
        {
            short num = 2642;
            Console.WriteLine($"Лет: {num/365}, недель: {(num%365)/7}, дней: {(num%365)%7}");
        }
    }
}
