// 3.  Простые переменные
// Создайте переменные со значениями: 5, F, Привет, 90.2.
// Создайте переменную, которую нельзя будет изменить и установите ей значение 67.
// Выведите переменную со значением "Привет" на экран.
// Важно: для каждой переменной пропишите соответсвующий тип данных.

using System;

namespace lesson3_task3
{
    class Program
    {
        static void Main()
        {
            byte num1 = 5;
            char sybm = 'F';
            string word = "Привет";
            float num2 = 90.2f;
            const byte NUM3 = 67;
            Console.WriteLine(word);
        }
    }
}
